In [1]:
import pandas as pd

# create sample data
sales = pd.DataFrame({
    'Region': ['North', 'North', 'South', 'South'],
    'Product': ['A', 'B', 'A', 'B'],
    'Sales': [100, 200, 150, 250]
})

In [2]:
sales

  Region Product  Sales
0  North       A    100
1  North       B    200
2  South       A    150
3  South       B    250

to pivot this data to show sales by region and product

In [3]:
# pivot the data
sales_pivot = sales.pivot(index='Region', columns='Product', values='Sales')

The pivot function has created a new DataFrame with the region names as the index, the product names as the columns, and the sales values as the cell values.

In [4]:
sales_pivot

Product    A    B
Region
North    100  200
South    150  250

to melt this data back into its original form

In [5]:
# melt the data
sales_melt = sales_pivot.reset_index().melt(id_vars=['Region'], value_vars=['A', 'B'], var_name='Product', value_name='Sales')

In [6]:
sales_melt

  Region Product  Sales
0  North       A    100
1  South       A    150
2  North       B    200
3  South       B    250

The melt function has melted the pivoted DataFrame back into its original form, with one row for each combination of region, product, and sales. The reset_index function is used to convert the index back into a column, which can then be used as an identifier variable in the melt function.